local M,L = unpack(select(2,...))
-- Russan here

if M.L == "ruRU" then
	
	local _L = {
			['lang_loaded'] = true,
			['hello_world'] = "DerpyMedia: Используйте |cffaaaa22/py|r для вызова настроек.",
			['close'] = "Закрыть",
			['hide'] = "Спрятать",
			['back'] = "Назад",
			['reload'] = "Reload",
			['stuffing'] = {
				["srch"] = "Поиск",
				["rclick"] = "Щелкните правой кнопкой для начала поиска.",
			},
			['derpyraid'] = {
				["rinst"] = "Щелкните правой или левой кнопкой,\n чтобы пролистать вперед или назад.",
				["rmemcount"] = "Вагонов в рейде:",
				["rcombat"] = "Вы находитесь в бою.",
				["rgroup"] = "Рейдовая группа ",
				["group"] = "В Режиме Группы",
			},
			['tweaks'] = {
				["repairtrue"] = "Ремонт",
				["repairtrue_g"] = "Ремонт (Гильдейский Банк)",
				["repairfalse"] = "Недостаточно денег для ремонта",
				["repairfalse_g"] = "Исчерпан дневной лимит для ремонта",
				["malinvacc"] = "Приглашение Принято: ",
				["malinvde"] = "Приглашение Отклонено: ",
				["malduelde"] = "Дуэль отклонена: ",
				["r_over"] = "Распускаю рейд.",
			},
			['tweaks_st'] = {
				["junk"] = "Продажа Хлама",
				["guild_repair"] = "Гильдейский Авторемонт",
				["autoinv"] = "Автоприглашение",
				["autoacceptinv"] =  "Принятие Приглашений",
				["autodeclineinv"] = "Отклонять Приглашения",
				["declineduels"] = "Отклонять Дуэли",
				["repair"] = "Авторемонт"
			},
			['clocks'] = {
				["wgbellow1"] = {
					[1] = "До начала битвы за ",
					[2] = " меньше минуты!",
				},
				["wgbellow15"]= {
					[1] = "До начала битвы за ",
					[2] = " меньше 15 минут!",
				},
				["tolbar"] = "Тол Барад",
				["lagspring"] = "Озеро Ледяных Оков",
				["wgtoolna"] = "Не доступно",
				["wgtoolinprogress"] = "Идет бой",
				["session"] = "Время сессии:",
				["total"] = "Общее время игры:",
			},
			['bags'] = {
				["free"] = "Свободно:",
				["gold"] = "Всего денег:",
				["nomore"] = "Все сумки заполненны!",
			},
			['dur'] = {
				["durtable"] = {
					[1] = {1, "Голова", 1000},
					[2] = {3, "Плечо", 1000},
					[3] = {5, "Грудь", 1000},
					[4] = {6, "Пояс", 1000},
					[5] = {9, "Запястья", 1000},
					[6] = {10, "Кисти рук", 1000},
					[7] = {7, "Ноги", 1000},
					[8] = {8, "Ступни", 1000},
					[9] = {16, "Правая рука", 1000},
					[10] = {17, "Левая рука", 1000},
					[11] = {18, "Оружие дальнего боя", 1000}
				},
				["durtool"] = "Cостояние брони:",
			},
			['map'] = {
				['coord'] = "Координаты: ",
				['cursor'] = "Курсор",
			},
			['latency'] = {
				["ping"] = "задержка:",
				["pingval"] = " мс",
				["framerate"] = "Частота смены кадров:",
				["framerateval"] = " к/c",
				["memorytool"] = "Детальная информация по аддонам:",
				["memorytotal"] = "Захаванно аддонами:",
				["memorymfrom"] = " мБ",
				["memorykfrom"] = " кБ",
				["_local"] = "Локальная ",
				["global"] = "Глобальная ",
				["band"] = "Скорость загрузки:",
				["done"] = "Загружено:",
				["mps"] = " мБ/с",
			},
			['avoid'] = {
				["avoid"] = "Распределение:",
				["miss"] = "Промах:",
				["dodge"] = "Уклонение:",
				["parry"] = "Парирование:",
				["block"] = "Блок:",
				["honor"] = "Очки Чести:",
				["cc"] = "Очки Завоеваний:",
			},
			['raid_primochka'] = {
				["Disband"] = "Распустить Рейд/Группу",
				["Role"] = "Проверка Ролей",
				["Tank"] = "Главный Танк",
				["Assist"] = "Главный Наводчик",
				["Ready"] = "Проверка Готовности",
				["sure1"] = "В некоторых случаях роспуск рейда приводит к резкому ухудшению физического здоровья, продолжить?",
				["sure2"] = "О мой бох! ТЫ УВЕРЕН?!",
			},			
	}

	for t in pairs (_L) do L[t] = _L[t]; end; wipe(_L);
end	